results/routeA/initialization_check/A-Ra1e4-medium/0/gh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
-0.000880281690140845
-0.000880281690140845
-0.000880281690140845
-0.000880281690140845
-0.0008802816901408448
-0.000880281690140845
-0.000880281690140845
-0.0008802816901408449
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-0.000880281690140845
-0.002640845070422535
-0.004401408450704224
-0.006161971830985916
-0.007922535211267605
-0.009683098591549295
-0.01144366197183099
-0.01320422535211267
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-0.0008802816901408452
-0.002640845070422535
-0.004401408450704224
-0.006161971830985916
-0.007922535211267605
-0.009683098591549295
-0.01144366197183099
-0.01320422535211267
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-0.1408450704225352
-0.1408450704225352
-0.1408450704225352
-0.1408450704225352
-0.1408450704225352
-0.1408450704225352
-0.1408450704225352
-0.1408450704225352
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
