results/routeA/initialization_check/A-Ra1e4-medium/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
-0.0008802816901408451
-0.0008802816901408451
-0.0008802816901408451
-0.0008802816901408451
-0.0008802816901408451
-0.0008802816901408451
-0.0008802816901408451
-0.0008802816901408451
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-0.0008798415492957747
-0.002639524647887324
-0.004399207746478873
-0.006158890845070423
-0.007918573943661971
-0.009678257042253521
-0.01143794014084507
-0.01319762323943662
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-0.0008807218309859155
-0.002642165492957746
-0.004403609154929577
-0.006165052816901408
-0.00792649647887324
-0.009687940140845071
-0.0114493838028169
-0.01321082746478873
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform -0.1408450704225352;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
