results/routeA/initialization_check/A-Ra1e4-medium/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           uniform 0.9995000000000001;
    }
    coldWall
    {
        type            calculated;
        value           uniform 1.0005;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 1;
    }
    topWall
    {
        type            calculated;
        value           uniform 1;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
